@echo off

::----------------------------------------------------------------------------
:: プロジェクトを生成
::----------------------------------------------------------------------------
pushd "%~dp0"
if not exist ".build" (
	call "@make_project.cmd"
)
popd

:: UTF-8
chcp 65001 > nul

:: 変数の展開を適切に行う
setlocal enabledelayedexpansion

cd /d "%~dp0"/.build

::----------------------------------------------------------------------------
:: ソリューションファイル sln を検出
::----------------------------------------------------------------------------
set RETRY_COUNT = 0

:retry
for /f "usebackq" %%A in (`dir /b *.sln`) do set SLN_FILE_NAME=%%A 2>&1

if exist "%SLN_FILE_NAME%" (
	goto boot
)

:: .buildフォルダがある状態で中身が空だった場合は再度プロジェクトを生成
pushd "%~dp0"
call "@make_project.cmd"
popd
set /a RETRY_COUNT+=1

if %RETRY_COUNT% neq 2 goto retry

::----------------------------------------------------------------------------
:: エラー
::----------------------------------------------------------------------------
:error

echo ERROR : プロジェクトファイル sln が見つかりません。
pause
exit /b 1

::----------------------------------------------------------------------------
:: ソリューションを起動
::----------------------------------------------------------------------------
:boot
	start %SLN_FILE_NAME%

:finish
endlocal
